app/controllers/emails_controller.rb

    def show
      @email = Email.all.find(params[:id])
---
SELECT "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
      @email = Email.new()
      @email.object = Faker::Color.color_name
      @email.body = Faker::GreekPhilosophers.quote

      if @email.save
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "gray"], ["body", "The unexamined life is not worth living."], ["created_at", "2020-11-19 18:11:59.480838"], ["updated_at", "2020-11-19 18:11:59.480838"]]