app/controllers/tasks_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "tasks" ("created_at", "updated_at", "title", "deadline", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-11-18 21:15:40.757079"], ["updated_at", "2020-11-18 21:15:40.757079"], ["title", "prout"], ["deadline", "2020-11-25 00:00:00"], ["category_id", 2]]
---
  def create
    @task = Task.new(task_params)
    @category = Category.find(category_params)
    @task.category = @category

    if @task.save