app/views/emails/create.js.erb

document.getElementById('target').insertAdjacentHTML("beforeend", "<li><%= @email.object %>, <%=  @email.body  %></li>")
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "gold"], ["body", "Rhetoric is the art of ruling the minds of men."], ["created_at", "2020-11-19 16:00:17.769248"], ["updated_at", "2020-11-19 16:00:17.769248"]]