app/views/emails/index.html.erb

<table id="target">
    <% Email.all.each do |email|  %>
---
SELECT "emails".* FROM "emails"